Revit 2024 API
RebarTrimExtendData.AddBarGeometry Method
Overload List
Name | Description
AddBarGeometry(IList<Curve>)
 Adds a new rebar geometry. This information is set to the rebar after the API execution is finished successfully.
AddBarGeometry(CurveLoop)
 Adds a new rebar geometry. This information is set to the rebar after the API execution is finished successfully.
See Also
RebarTrimExtendData Class
RebarTrimExtendData Members
Autodesk.Revit.DB.Structure Namespace